app/controllers/devise/sessions_controller.rb

	def create
		@user = User.find_by(:email => params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "test@example.com"]]